In [1]:
import pandas as pd # type: ignore
data = [1,2,3]
df = pd.DataFrame(data)
print(df)

   0
0  1
1  2
2  3

In [12]:
student = [
    ['Tom',90],
    ['Jack',80],
    ['Jill',70]
]
data_student = pd.DataFrame(student, columns=['Name','Grade'])
print(data_student)

In [17]:
new_student = [
    ['Sam', 60], 
    ['Mary',50],
    ['John',40],
    ['Joseph',30]
]
data_new_student = pd.DataFrame(new_student, columns=['Name','Grade'])
data_student = pd.concat([data_student,data_new_student], ignore_index=True)
print(data_student)

     Name  Grade
0     Tom     90
1    Jack     80
2    Jill     70
3     Sam     60
4    Mary     50
5    John     40
6  Joseph     30

In [13]:
data_student.head(3)

   Name  Grade
0   Tom     90
1  Jack     80
2  Jill     70

In [18]:
data_student.tail(3)

     Name  Grade
4    Mary     50
5    John     40
6  Joseph     30

In [19]:
data_student.to_csv('data_student.csv')